Missing Data
Duplicates
Outliers
sample
dummies

In [2]:
import numpy as np
import pandas as pd

## Handling Missing Data

In [3]:
from numpy import nan as NA

In [4]:
s = pd.Series([3, NA, 8, NA, 5])
s

0    3.0
1    NaN
2    8.0
3    NaN
4    5.0
dtype: float64

In [5]:
s.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [6]:
myser = s[s.notnull()]
myser

0    3.0
2    8.0
4    5.0
dtype: float64

In [7]:
s.dropna()

0    3.0
2    8.0
4    5.0
dtype: float64

In [8]:
#

In [9]:
df = pd.DataFrame([[4, 9, 5], [2, NA, NA], [NA, NA, NA], [NA, 8, 6]])
df

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [10]:
cleaned = df.dropna()
cleaned

     0    1    2
0  4.0  9.0  5.0

In [11]:
df

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [12]:
df.dropna(how='all')

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
3  NaN  8.0  6.0

In [13]:
df

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [14]:
df[4] = NA
df

     0    1    2   4
0  4.0  9.0  5.0 NaN
1  2.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  8.0  6.0 NaN

In [15]:
df.dropna(axis=1, how='all')

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [16]:
#

In [17]:
d = [[14, NA, NA], [12, NA, NA], [18, NA, 7], [18, NA, 16], [15, 12, 19], [13, 1, 6]]
df = pd.DataFrame(d)
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [18]:
df.dropna()

    0     1     2
4  15  12.0  19.0
5  13   1.0   6.0

In [19]:
df.dropna(thresh=2)

    0     1     2
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

### fillna : Filling In Missing Data

In [20]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [21]:
frame = df.fillna(0)
frame

    0     1     2
0  14   0.0   0.0
1  12   0.0   0.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [22]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [23]:
df.fillna({1: 0, 2: 9})

    0     1     2
0  14   0.0   9.0
1  12   0.0   9.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [24]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [25]:
_ = df.fillna(0, inplace=True)

In [26]:
df

    0     1     2
0  14   0.0   0.0
1  12   0.0   0.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [27]:
#

In [28]:
d = [[15, 12, 19], [13, 1, 6], [18, NA, 7], [18, NA, 16], [14, NA, NA], [12, NA, NA]]
df = pd.DataFrame(d)
df

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   NaN   7.0
3  18   NaN  16.0
4  14   NaN   NaN
5  12   NaN   NaN

In [29]:
df.fillna(method='ffill')

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   1.0   7.0
3  18   1.0  16.0
4  14   1.0  16.0
5  12   1.0  16.0

In [30]:
df.fillna(method='ffill', limit=3)

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   1.0   7.0
3  18   1.0  16.0
4  14   1.0  16.0
5  12   NaN  16.0

In [31]:
#

In [32]:
s = pd.Series([6, NA, 4, NA, 5])
s

0    6.0
1    NaN
2    4.0
3    NaN
4    5.0
dtype: float64

In [33]:
s.mean()

5.0

In [34]:
s.fillna(s.mean())

0    6.0
1    5.0
2    4.0
3    5.0
4    5.0
dtype: float64

### drop_duplicates : Removing Duplicates

In [35]:
frame = pd.DataFrame({'col1': ['a', 'b', 'a', 'b', 'a', 'b', 'b'],
                      'col2': [1, 1, 2, 3, 3, 4, 4]})
frame

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4
6    b     4

In [36]:
frame.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
df = frame.drop_duplicates()
df

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4

In [38]:
frame

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4
6    b     4

In [39]:
frame.drop_duplicates(['col1'])

  col1  col2
0    a     1
1    b     1

In [40]:
frame.drop_duplicates(['col1'], keep='last')

  col1  col2
4    a     3
6    b     4

In [41]:
frame

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4
6    b     4

In [42]:
frame.drop_duplicates(['col2'])

  col1  col2
0    a     1
2    a     2
3    b     3
5    b     4

In [43]:
frame.drop_duplicates(['col2'], keep='last')

  col1  col2
1    b     1
2    a     2
4    a     3
6    b     4

### replace : Replacing Values

In [44]:
myser = pd.Series([13, 9, 20, 9, 18, 17])
myser

0    13
1     9
2    20
3     9
4    18
5    17
dtype: int64

In [45]:
myser.replace(9, np.nan)

0    13.0
1     NaN
2    20.0
3     NaN
4    18.0
5    17.0
dtype: float64

In [46]:
myser.replace({9: np.nan, 18: 0})

0    13.0
1     NaN
2    20.0
3     NaN
4     0.0
5    17.0
dtype: float64

In [47]:
myser.replace([9, 18], [np.nan, 0])

0    13.0
1     NaN
2    20.0
3     NaN
4     0.0
5    17.0
dtype: float64

### cut

In [48]:
score = [20, 8, 17, 10]
bins  = [0, 9, 15, 20]

In [49]:
c = pd.cut(score, bins)
c.categories

IntervalIndex([(0, 9], (9, 15], (15, 20]],
              closed='right',
              dtype='interval[int64]')

In [50]:
c

[(15, 20], (0, 9], (15, 20], (9, 15]]
Categories (3, interval[int64]): [(0, 9] < (9, 15] < (15, 20]]

In [51]:
c.codes

array([2, 0, 2, 1], dtype=int8)

In [52]:
pd.value_counts(c)

(15, 20]    2
(0, 9]      1
(9, 15]     1
dtype: int64

In [53]:
#

In [54]:
score = [20, 8, 17, 10]
bins  = [0, 9, 15, 20]

x = pd.cut(score, bins, labels=["bad", "medium", "good" ])
x

['good', 'bad', 'good', 'medium']
Categories (3, object): ['bad' < 'medium' < 'good']

In [55]:
pd.value_counts(x)

good      2
bad       1
medium    1
dtype: int64

In [56]:
#

In [57]:
ages = [20, 58, 24, 72, 100]
bins = [18, 25, 35, 60, 110]
x = pd.cut(ages, bins)
pd.value_counts(x)

(18, 25]     2
(60, 110]    2
(35, 60]     1
(25, 35]     0
dtype: int64

In [58]:
c= pd.cut(ages, bins, labels=['Youth', 'YoungAdult', 'MiddleAged', 'Senior'])
pd.value_counts(c)

Youth         2
Senior        2
MiddleAged    1
YoungAdult    0
dtype: int64

### Detecting Outliers

In [62]:
df = pd.DataFrame(np.random.randn(1000, 3))
df.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.016123    -0.024824     0.007632
std       0.989673     0.985312     0.978938
min      -3.312228    -3.628728    -2.780585
25%      -0.668510    -0.692089    -0.681583
50%       0.015452    -0.022509     0.022674
75%       0.691788     0.649919     0.689246
max       2.869647     3.206321     2.982859

In [63]:
df.head()

          0         1         2
0  1.826147  0.820126  0.711111
1  0.151278  0.393476 -1.054926
2  0.539114 -2.667995  1.045913
3 -0.070976 -0.016697 -1.259420
4 -0.256504 -0.649326  1.207095

In [64]:
s = np.sign(df)
s.head()

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0 -1.0
2  1.0 -1.0  1.0
3 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0

In [65]:
df[np.abs(df) > 3] = s * 3

In [66]:
df.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.016438    -0.024166     0.007632
std       0.988665     0.980689     0.978938
min      -3.000000    -3.000000    -2.780585
25%      -0.668510    -0.692089    -0.681583
50%       0.015452    -0.022509     0.022674
75%       0.691788     0.649919     0.689246
max       2.869647     3.000000     2.982859

### take

In [157]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)))
df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [74]:
p = np.random.permutation(4)
p

array([3, 2, 1, 0])

In [75]:
df.take(p)  # Return the elements in the given positional indices along an axis.

          0         1         2
3 -0.070976 -0.016697 -1.259420
2  0.539114 -2.667995  1.045913
1  0.151278  0.393476 -1.054926
0  1.826147  0.820126  0.711111

### sample : return a random sample of items from an axis of object.

In [82]:
df = pd.DataFrame(np.arange(30).reshape((6, 5)))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [87]:
df.sample(n=2)

    0   1   2   3   4
0   0   1   2   3   4
4  20  21  22  23  24

In [91]:
s = pd.Series([15, 7, 12, 16])
s.sample(n=2)

0    15
2    12
dtype: int64

In [163]:
#

In [92]:
a = ['s1', 's2', 's3', 's4']
b = {'F1': [7, 4, 6, 0], 'F2': [2, 1, 3, 0],'F3': [9, 4, 1, 7]}
df = pd.DataFrame(data=b, index=a)
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [165]:
df.sample(n=2, random_state=1)

    F1  F2  F3
s4   0   0   7
s3   6   3   1

In [96]:
df.sample(n=2, weights='F3', random_state=1)

    F1  F2  F3
s1   7   2   9
s4   0   0   7

In [97]:
s

0    15
1     7
2    12
3    16
dtype: int64

In [99]:
s.sample(n=6, replace=True)

2    12
1     7
1     7
1     7
0    15
3    16
dtype: int64

In [100]:
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [101]:
df.sample(frac=0.5)

    F1  F2  F3
s1   7   2   9
s3   6   3   1

In [102]:
df.sample(frac=2, replace=True)

    F1  F2  F3
s4   0   0   7
s2   4   1   4
s1   7   2   9
s4   0   0   7
s1   7   2   9
s4   0   0   7
s1   7   2   9
s4   0   0   7

In [103]:
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [173]:
myser = df['F1'].sample(n=3)
myser

s2    4
s3    6
s1    7
Name: F1, dtype: int64

### get_dummies

In [104]:
s = pd.Series(list('abca'))
s

0    a
1    b
2    c
3    a
dtype: object

In [175]:
df = pd.get_dummies(s)
df

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [176]:
myser = pd.Series(list('abcaa'))
pd.get_dummies(myser)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0
4  1  0  0

In [106]:
lst = ['a', 'b', np.nan]
pd.get_dummies(lst)

   a  b
0  1  0
1  0  1
2  0  0

In [110]:
aa = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]], columns = ['a', 'b', np.nan])

In [178]:
#

In [113]:
df = pd.DataFrame({'F1': ['a', 'b', 'c'], 'F2': ['b', 'a', 'a'], 'F3': [7, 2, 3]})
df

  F1 F2  F3
0  a  b   7
1  b  a   2
2  c  a   3

In [117]:
type(df['F1'])

pandas.core.series.Series

In [118]:
pd.get_dummies(df['F1'])

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1

In [122]:
pd.get_dummies(df['F2'])

   a  b
0  0  1
1  1  0
2  1  0

In [120]:
df

  F1 F2  F3
0  a  b   7
1  b  a   2
2  c  a   3

In [123]:
pd.get_dummies(df)

   F3  F1_a  F1_b  F1_c  F2_a  F2_b
0   7     1     0     0     0     1
1   2     0     1     0     1     0
2   3     0     0     1     1     0

In [185]:
pd.get_dummies(df, prefix=['col1', 'col2'])

   F3  col1_a  col1_b  col1_c  col2_a  col2_b
0   7       1       0       0       0       1
1   2       0       1       0       1       0
2   3       0       0       1       1       0

In [186]:
d = pd.get_dummies(df['F1'])
d

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1

In [187]:
df

  F1 F2  F3
0  a  b   7
1  b  a   2
2  c  a   3

In [188]:
dfdummy = df[['F2','F3']].join(d)
dfdummy

  F2  F3  a  b  c
0  b   7  1  0  0
1  a   2  0  1  0
2  a   3  0  0  1

<div class="alert alert-block alert-info">
<div style="direction:rtl;text-align:right;font-family:B Lotus, B Nazanin, Tahoma">    <br>     <br>   <br>1400-1401<br>
</div>
<a href="https://github.com/Amin-Golzari-Oskouei/Python-Programming-Course-Advanced-2021"> Codes and Projects (click here) </a>
<a href="https://drive.google.com/drive/folders/1Dx3v7fD1QBWL-MNP2hd7iIxaRbeALkkA">slides and videos (click here)</a>
</div>